BigZ2000/gbairai/tools/firmware-esp32/gbairai_buzzer/gbairai_buzzer.ino
  // Respiration : 0..255 sinusoïdal lent.
  float phase = (sin(now / 350.0) + 1.0) / 2.0;     // 0..1
  uint8_t breath = 40 + (uint8_t)(phase * 180);

  // L'anneau reprend le rythme de l'état courant (allumé/pulsé/éteint).
  switch (gLed) {
    case L_OFFLINE:  setButtonLed(breath / 6); break;   // très faible, respire
    case L_PORTAL:   setButtonLed(breath); break;       // pulse franchement (à configurer)
    case L_AWAITING: setButtonLed(breath); break;       // pulse (à appairer)
    case L_READY:    setButtonLed(30); break;           // veilleuse discrète
    case L_ARMED:    setButtonLed(255); break;          // PLEIN FEU : « tu peux buzzer »
    case L_WINNER:   setButtonLed(255); break;
    case L_LOCKED:   setButtonLed(0); break;            // éteint : verrouillé
    case L_REVEAL:   setButtonLed(120); break;
    case L_PRESSED:  setButtonLed(255); break;
  }

  switch (gLed) {
    case L_OFFLINE:  setAll(rgb(breath/3, 0, 0)); break;                            // rouge sombre lent
    case L_PORTAL:   setAll(rgb(breath, breath, breath)); break;                    // blanc pulsé (config)
    case L_AWAITING: setAll(rgb(breath, (uint8_t)(breath*0.7), 0)); break;          // ambre pulsé
    case L_READY:    setAll(rgb(10, 40, 20)); break;                                // vert très doux (prêt)
    case L_ARMED:    setAll(rgb(0, (uint8_t)(breath*0.5), breath)); break;          // bleu pulsé
    case L_WINNER:   setAll(rgb(0, 220, 60)); break;                                // vert vif
    case L_LOCKED:   setAll(rgb(160, 0, 0)); break;                                 // rouge
    case L_REVEAL:   setAll(rgb(230, 140, 0)); break;                               // orange
    case L_PRESSED:  setAll(rgb(255, 255, 255)); break;
  }
}

// ── Son piézo (mêmes déclencheurs que le simulateur Web Audio) ──────────────
// `tone(pin, freq, durée)` (Arduino-ESP32) ; non bloquant pour des bips courts.
void sndBeep(int freq, int dur) { tone(BUZZER_PIN, freq, dur); }
void sndConnect() { sndBeep(660, 90); }
void sndAwaiting(){ sndBeep(500, 90); }
void sndPaired()  { sndBeep(700, 90); delay(110); sndBeep(950, 130); }
void sndArmed()   { sndBeep(880, 60); }
void sndWinner()  { sndBeep(660,140); delay(120); sndBeep(880,140); delay(120); sndBeep(1175,180); }
void sndLocked()  { sndBeep(160, 260); }
void sndReveal()  { sndBeep(520, 180); }
void sndPress()   { sndBeep(1000, 50); }

void playSoundForState(LedState s) {
  switch (s) {
    case L_ARMED:  sndArmed();  break;
    case L_WINNER: sndWinner(); break;
    case L_LOCKED: sndLocked(); break;
    case L_REVEAL: sndReveal(); break;
    default: break;
  }
}

void setLedFromState(const String& s) {
  if      (s == "armed")  gLed = L_ARMED;
  else if (s == "winner") gLed = L_WINNER;
  else if (s == "locked") gLed = L_LOCKED;
  else if (s == "reveal") gLed = L_REVEAL;
  else                    gLed = L_READY;   // 'idle' ou inconnu
}

// ============================================================================
//  Parsing minimal des messages (forme fixe → pas besoin d'ArduinoJson)
// ============================================================================
bool jsonHas(const char* p, const char* needle) { return strstr(p, needle) != nullptr; }

// Extrait la valeur texte d'une clé, ex. jsonField(p, "\"state\":\"").
String jsonField(const char* p, const char* keyQuoted) {
  const char* k = strstr(p, keyQuoted);
  if (!k) return "";
  k += strlen(keyQuoted);
  const char* end = strchr(k, '"');
  if (!end) return "";
  return String(k).substring(0, end - k);
}

// ============================================================================
//  Envois
// ============================================================================
void sendHello() {
  // Signale au serveur que ce boot suit un reset d'usine (traçabilité admin) —
  // annoncé une seule fois, puis on ne le répète pas aux hello suivants.
  String m = "{\"type\":\"buzzer_hello\",\"mac\":\"" + gMac + "\",\"firmware\":\"" + FIRMWARE_VERSION + "\""
             + (gJustFactoryReset ? ",\"resetReason\":\"factory\"" : "") + "}";
  webSocket.sendTXT(m);
  gJustFactoryReset = false;
}
void sendBuzz() {
  String m = "{\"type\":\"buzz\",\"source\":\"device\",\"mac\":\"" + gMac + "\"}";
  webSocket.sendTXT(m);
}
void sendTelemetry() {
  if (!gConnected) return;
  String m = "{\"type\":\"device_telemetry\",\"mac\":\"" + gMac + "\",\"battery\":" +
             String(readBatteryPercent()) + ",\"rssi\":" + String(WiFi.RSSI()) + "}";
  webSocket.sendTXT(m);
}

// Mise à jour OTA : télécharge et flashe le firmware depuis l'URL fournie.
// Refusée en cours de partie (on ne coupe jamais un buzzer en plein jeu).
// Remonte au serveur le résultat d'une MAJ (journalisé côté admin).
void sendOtaResult(bool ok, const String& version, const String& err) {
  String m = "{\"type\":\"ota_result\",\"mac\":\"" + gMac + "\",\"ok\":" + (ok ? "true" : "false")
             + ",\"version\":\"" + version + "\"";
  if (!ok) { String e = err; e.replace("\"", "'"); m += ",\"error\":\"" + e + "\""; }
  m += "}";
  webSocket.sendTXT(m);
  webSocket.loop();       // laisse la trame partir avant un éventuel redémarrage
  delay(120);
}

// Mise à jour OTA. Supporte HTTP **et HTTPS** : le binaire est servi par le
// serveur Gbairai lui-même (https://<host>/uploads/firmware/xxx.bin), donc une
// liaison TLS est indispensable — l'ancien WiFiClient simple échouait sur https.
// TLS sans validation de CA (setInsecure) : le flux est chiffré ; l'intégrité est
// garantie par le contrôle de somme/magic byte du bootloader ESP32.
void doOta(const String& url, const String& version) {
  if (url.isEmpty() || inGame()) return;
  Serial.printf("[OTA] mise à jour depuis %s\n", url.c_str());

  gOtaProgress = 0;                          // active le retour visuel dédié
  renderLed();

  httpUpdate.rebootOnUpdate(false);          // on veut rendre compte AVANT de redémarrer
  httpUpdate.onProgress([](int cur, int total) {
    if (total > 0) gOtaProgress = (cur * 100) / total;
    renderLed();                             // barre de progression sur l'anneau
  });

