BigZ2000/gbairai/tools/firmware-esp32/gbairai_buzzer/gbairai_buzzer.ino
  t_httpUpdate_return ret;
  if (url.startsWith("https://")) {
    WiFiClientSecure secure;
    secure.setInsecure();                    // pas d'épinglage de CA sur l'appareil
    secure.setTimeout(20000);
    ret = httpUpdate.update(secure, url);
  } else {
    ret = httpUpdate.update(gOtaClient, url);
  }

  gOtaProgress = -1;

  if (ret == HTTP_UPDATE_OK) {
    Serial.println("[OTA] succès → redémarrage");
    sendOtaResult(true, version, "");
    // 3 clignotements verts : succès visible sans câble série.
    for (int i = 0; i < 3; i++) { setAll(rgb(0, 220, 60)); setButtonLed(255); delay(150);
                                  setAll(0); setButtonLed(0); delay(150); }
    ESP.restart();
  } else {
    String err = httpUpdate.getLastErrorString();
    Serial.printf("[OTA] échec (%d) %s\n", httpUpdate.getLastError(), err.c_str());
    sendOtaResult(false, version, err);
    // 3 clignotements rouges : échec identifiable d'un coup d'œil.
    for (int i = 0; i < 3; i++) { setAll(rgb(200, 0, 0)); delay(150);
                                  setAll(0); delay(150); }
  }
}

// ============================================================================
//  Évènements WebSocket
// ============================================================================
void onWsEvent(WStype_t type, uint8_t* payload, size_t length) {
  switch (type) {
    case WStype_CONNECTED:
      gConnected = true;
      gLed = L_READY;
      sendHello();                              // annonce de l'appareil au boot
      sendTelemetry();                          // 1re télémétrie immédiate
      sndConnect();
      Serial.println("[WS] connecté → buzzer_hello");
      break;

    case WStype_DISCONNECTED:
      gConnected = false;
      gLed = L_OFFLINE;
      Serial.println("[WS] déconnecté");
      break;

    case WStype_TEXT: {
      const char* p = (const char*)payload;
      if (jsonHas(p, "\"awaiting_claim\""))       { gLed = L_AWAITING; sndAwaiting(); Serial.println("[WS] à appairer"); }
      else if (jsonHas(p, "\"pairing_success\"")) { gLed = L_READY;    sndPaired();   Serial.println("[WS] appairé"); }
      else if (jsonHas(p, "\"type\":\"led\"")) {
        String s = jsonField(p, "\"state\":\"");
        setLedFromState(s);
        playSoundForState(gLed);
        Serial.printf("[WS] led ← %s\n", s.c_str());
      }
      else if (jsonHas(p, "\"type\":\"ota\"")) {  // mise à jour proposée par le serveur
        doOta(jsonField(p, "\"url\":\""), jsonField(p, "\"version\":\""));
      }
      else if (jsonHas(p, "\"type\":\"factory_reset\"")) { // reset distant (admin)
        Serial.println("[WS] reset d'usine demandé par le serveur");
        doFactoryReset();
      }
      break;
    }
    default: break;
  }
}

// ============================================================================
//  Bouton (anti-rebond + front descendant)
// ============================================================================
void handleButton() {
  int b = digitalRead(BUTTON_PIN);
  uint32_t now = millis();
  if (b != gLastBtn && (now - gLastBtnMs) > 40) {   // 40 ms de debounce
    gLastBtnMs = now;
    gLastBtn = b;
    if (b == LOW) {                                 // appui (pull-up → LOW = pressé)
      gPressStartMs = now;                          // départ du chrono d'appui long
      gFlashUntil = now + 180;                      // flash blanc local immédiat
      sndPress();
      if (gConnected) { sendBuzz(); Serial.println("→ BUZZ"); }
    } else {
      gPressStartMs = 0;                            // relâché avant le seuil → rien
    }
  }

  // Reset d'usine par APPUI LONG (10 s) en fonctionnement : bien plus découvrable
  // que « tenir le bouton au démarrage ». L'anneau et la NeoPixel virent au rouge
  // pendant le décompte, pour que l'utilisateur comprenne ce qui va se passer.
  if (gPressStartMs && b == LOW) {
    uint32_t held = now - gPressStartMs;
    if (held > 3000) {                              // à partir de 3 s : avertissement visuel
      bool tick = (now / 150) % 2;
      setAll(tick ? rgb(220, 0, 0) : rgb(20, 0, 0));
      setButtonLed(tick ? 255 : 0);
    }
    if (held >= LONG_PRESS_RESET_MS) {
      Serial.println("[RESET] appui long → reset d'usine");
      doFactoryReset();                             // efface, puis redémarre
    }
  }
}

// ============================================================================
//  Configuration Wi-Fi + serveur (captive portal)
// ============================================================================
void startPortalIfNeeded() {
  WiFiManager wm;
  // Le portail ne demande QUE le Wi-Fi (SSID + mot de passe). Le serveur Gbairai
  // est codé en dur (GBAIRAI_HOST/PORT) → aucune saisie technique pour l'utilisateur.
  gLed = L_PORTAL;
  // ⚠️ autoConnect()/startConfigPortal() sont BLOQUANTS : loop() — et donc
  // renderLed() — ne tourne pas tant que le Wi-Fi n'est pas configuré. Sans le
  // rendu explicite ci-dessous, le bandeau restait ÉTEINT pendant toute la
  // configuration (le « blanc pulsé » n'apparaissait jamais). On allume donc en
  // blanc fixe avant de bloquer, et on le ré-affirme quand le point d'accès
  // démarre réellement (setAPCallback), seul moment où WiFiManager nous rend la main.
  setAll(rgb(255, 255, 255));
  setButtonLed(255);

  // Nom du point d'accès de configuration : "Gbairai-Buzzer-XXXX".
  String ap = "Gbairai-Buzzer-" + gMac.substring(gMac.length() - 5);
  ap.replace(":", "");
  wm.setConfigPortalTimeout(180);                   // 3 min puis re-tentative
  wm.setAPCallback([](WiFiManager*) {               // le portail vient de s'ouvrir
    Serial.println("[WiFi] portail ouvert → connecte-toi au Wi-Fi Gbairai-Buzzer-…");
    setAll(rgb(255, 255, 255));
    setButtonLed(255);
  });

  // Drapeau posé par doFactoryReset() : garantit l'ouverture du portail même si
  // l'effacement des identifiants Wi-Fi (NVS) avait échoué silencieusement —
  // bug connu de certaines combinaisons ESP32 core / WiFiManager où resetSettings()
  // ne prend pas effet si le pilote Wi-Fi n'était pas déjà démarré au moment du reset.
  prefs.begin("gbairai", false);
  bool forcePortal = prefs.getBool("force_portal", false);
  prefs.end();
  gJustFactoryReset = forcePortal;

  bool ok;
  if (forcePortal) {
    Serial.println("[WiFi] reset récent → portail forcé (identifiants connus ignorés)");
    ok = wm.startConfigPortal(ap.c_str());
  } else {
    // autoConnect : reconnecte au Wi-Fi connu, sinon ouvre le portail (bloquant).
    ok = wm.autoConnect(ap.c_str());
  }
  if (!ok) {
    // Le drapeau n'est PAS consommé ici : si l'utilisateur n'a pas eu le temps de
    // configurer (ou coupe le courant), le prochain boot rouvrira bien le portail.
    Serial.println("[WiFi] échec portail → redémarrage");
    delay(2000); ESP.restart();
  }

  // Configuration réussie → on peut consommer le drapeau en toute sécurité.
  if (forcePortal) {
    prefs.begin("gbairai", false);
    prefs.putBool("force_portal", false);
    prefs.end();
  }
  Serial.printf("[WiFi] connecté. Serveur = %s:%u\n", GBAIRAI_HOST, GBAIRAI_PORT);
}

// Effacement Wi-Fi + config puis redémarrage (rouvre le portail au reboot).
// Appelé soit par le bouton tenu au boot, soit par la commande serveur (admin).
void doFactoryReset() {
  Serial.println("[RESET] effacement Wi-Fi/config");

  // Ceinture ET bretelles : sur certaines combinaisons ESP32 core / WiFiManager,
  // wm.resetSettings() seul peut échouer à effacer les identifiants en NVS si le
  // pilote Wi-Fi n'a pas encore été démarré à cet instant (ex. reset physique au
  // tout premier boot). On force explicitement le driver puis l'effacement NVS
  // AVANT d'appeler resetSettings(), qui repasse derrière en confirmation.
  WiFi.mode(WIFI_STA);
  WiFi.disconnect(true, true);        // (wifioff, eraseAP) → efface les identifiants NVS
  delay(300);
  WiFiManager wm; wm.resetSettings();
  delay(200);

  // Drapeau "portail forcé" : même si l'effacement ci-dessus échouait malgré
  // tout, le prochain boot ouvrira le portail sans tenter l'ancien Wi-Fi.
  prefs.begin("gbairai", false);
  prefs.clear();
  prefs.putBool("force_portal", true);
  prefs.end();

  // clignotement rouge de confirmation
  for (int i = 0; i < 6; i++) { setAll(rgb(180,0,0)); delay(120);
                                setAll(0); delay(120); }
  ESP.restart();
}

