BigZ2000/gbairai/tools/firmware-esp32/gbairai_buzzer/gbairai_buzzer.ino
// Reset d'usine : bouton maintenu enfoncé au démarrage → efface Wi-Fi + config.
void maybeFactoryReset() {
  if (digitalRead(BUTTON_PIN) == LOW) {
    Serial.println("[RESET] bouton maintenu au boot");
    doFactoryReset();
  }
}

// ============================================================================
//  Setup / Loop
// ============================================================================
void setup() {
  Serial.begin(115200);
  pinMode(BUTTON_PIN, INPUT_PULLUP);
  // Luminosité volontairement modérée : une WS2812 tire ~60 mA en blanc plein.
  // Avec LED_COUNT=7 cela ferait ~420 mA — bien trop pour la broche 3V3 de la
  // carte, surtout pendant les pics d'émission Wi-Fi (risque de brownout/reset).
  // À 90/255 on plafonne autour de ~150 mA, ce qui reste sûr. Si tu alimentes le
  // bandeau en 5 V (VIN) avec sa propre masse, tu peux remonter jusqu'à 160–255.
  pixel.begin(); pixel.setBrightness(LED_COUNT > 1 ? 90 : 160); pixel.show();

  // Anneau lumineux du bouton arcade (4 broches) piloté en PWM via transistor.
#if BUTTON_LED_PIN >= 0
  #if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    ledcAttach(BUTTON_LED_PIN, BTN_LED_FREQ, BTN_LED_RES);
  #else
    ledcSetup(BTN_LED_CHANNEL, BTN_LED_FREQ, BTN_LED_RES);
    ledcAttachPin(BUTTON_LED_PIN, BTN_LED_CHANNEL);
  #endif
  setButtonLed(0);
#endif

  gMac = WiFi.macAddress();           // "AA:BB:CC:DD:EE:FF" (majuscules)
  gMac.toUpperCase();
  Serial.printf("\nGbairai Buzzer — MAC %s\n", gMac.c_str());

  maybeFactoryReset();                // reset d'usine si bouton tenu au boot
  startPortalIfNeeded();              // Wi-Fi (captive portal au 1er démarrage)

  // Connexion WebSocket au serveur codé en dur (chemin "/" — le serveur accepte tout chemin).
  // Port 443 → WSS (TLS, prod cloud) ; sinon WS clair (LAN). Sur ESP32, beginSSL
  // sans CA chiffre la liaison sans valider le certificat (suffisant ici ;
  // durcissement futur = épingler la CA Let's Encrypt via beginSslWithCA).
  if (GBAIRAI_PORT == 443) {
    Serial.println("[WS] liaison sécurisée (wss)");
    webSocket.beginSSL(GBAIRAI_HOST, GBAIRAI_PORT, "/");
  } else {
    webSocket.begin(GBAIRAI_HOST, GBAIRAI_PORT, "/");
  }
  webSocket.onEvent(onWsEvent);
  webSocket.setReconnectInterval(3000);   // reconnexion auto toutes les 3 s
  webSocket.enableHeartbeat(15000, 3000, 2);
}

void loop() {
  webSocket.loop();
  handleButton();
  renderLed();
  // Télémétrie périodique (batterie + signal Wi-Fi).
  if (millis() - gLastTelemetryMs > TELEMETRY_MS) { gLastTelemetryMs = millis(); sendTelemetry(); }
}
